Repository: 777BDVGP/Grbl-Panel
Catalog: Grbl-Panel/GrblGui.*.resx
Languages: fr_fr

# SaveToolStripMenuItem.Text
source: Save
fr_fr: Sauver

# ExitToolStripMenuItem.Text
source: Exit
fr_fr: Quitter

# ToolStripMenuItem1.Text
source: File
fr_fr: Fichier

# ToolsToolStripMenuItem.Text
source: Tools
fr_fr: Outils

# AboutToolStripMenuItem.Text
source: About
fr_fr: A propos

# HelpToolStripMenuItem.Text
source: Help
fr_fr: Aide

# cbSpindleCoarse.Text
source: Coarse
fr_fr: Gros Grain

# btnSpindleOverrideReset.Text
source: Reset
fr_fr: Réinitialiser

# btnRapidOverrideReset.Text
source: Reset
fr_fr: Réinitialiser

# btnFeedOverrideReset.Text
source: Reset
fr_fr: Réinitialiser

# cbFeedCoarse.Text
source: Coarse
fr_fr: Gros Grain

# Label44.Text
source: Spindle
fr_fr: Broche

# Label22.Text
source: Rapid
fr_fr: Rapide

# Label46.Text
source: Feed
fr_fr: Avance

# gbOverrides.Text
source: Overrides
fr_fr: Contourner

# cbFeedHold.Text
source: FH
fr_fr: CF

# cbFeedHold.ToolTip
source: Feed Hold
fr_fr: Maintient Avance

# cbStartResume.Text
source: CS
fr_fr: DC

# cbStartResume.ToolTip
source: Cycle Start
fr_fr: Démarre Cycle

# cbResetAbort.ToolTip
source: Reset
fr_fr: Réinitialiser

# cbLimitX.ToolTip
source: X Limit
fr_fr: Limite X

# cbDoorOpen.Text
source: D
fr_fr: P

# cbDoorOpen.ToolTip
source: Door Open
fr_fr: Porte Ouverte

# cbProbePin.Text
source: P
fr_fr: S

# cbProbePin.ToolTip
source: Probe Pin
fr_fr: Broche pour Sonde

# cbLimitZ.ToolTip
source: Z Limit
fr_fr: Limite Z

# cbLimitY.ToolTip
source: Y Limit
fr_fr: Limite Y

# gbPinStatus.Text
source: Pins
fr_fr: Broche

# Label14.Text
source: FeedRate
fr_fr: Vit. Avance

# Label53.Text
source: Tool
fr_fr: Outil

# Label50.Text
source: Spindle RPM
fr_fr: Broche t/mn

# cbxStateFeedMode.Items1
source: Unit/Min G94
fr_fr: Unité/Min G94

# cbxStateFeedMode.Items2
source: Inverse Time G93
fr_fr: Inversion Temps G93

# cbxStateDistance.Items1
source: Absolute G90
fr_fr: Absolue G90

# cbxStateDistance.Items2
source: Incremental G91
fr_fr: Incrémentale G91

# Label16.Text
source: Units
fr_fr: Unités

# cbxStateUnits.Items1
source: Metric G21
fr_fr: Métrique G21

# cbxStateUnits.Items2
source: Inch G20
fr_fr: Impérial G20

# Label123.Text
source: Distance Mode
fr_fr: Mode Distance

# Lalbel49.Text
source: Active Plane
fr_fr: Plan Actif

# Label47.Text
source: Coolant
fr_fr: Refroidisseur

# Label15.Text
source: Work Offset
fr_fr: Décalage Travail

# cbxStateCoolant.Items1
source: On M8
fr_fr: Allumé M8

# cbxStateCoolant.Items2
source: Off M9
fr_fr: Eteint M9

# Label45.Text
source: Spindle
fr_fr: Broche

# Label17.Text
source: FeedRate Mode
fr_fr: Mode Vit. Avance

# cbxStateSpindle.Items1
source: CW M3
fr_fr: SH M3

# cbxStateSpindle.Items2
source: CCW M4
fr_fr: SAH M4

# cbxStateSpindle.Items3
source: Off M5
fr_fr: Eteint M5

# gbState.Text
source: State
fr_fr: Etat

# btnCheckMode.Text
source: Check
fr_fr: Vérifie

# btnReset.Text
source: Reset
fr_fr: Réinitialise

# btnHold.Text
source: Hold
fr_fr: Maintiens

# btnStartResume.Text
source: Start
fr_fr: Démarre

# btnUnlock.Text
source: Unlock
fr_fr: Débloque

# gbControl.Text
source: Control
fr_fr: Contrôle

# Label9.Text
source: Manual Command
fr_fr: Commande Manuelle

# btnSend.Text
source: Send
fr_fr: Envois

# $this.Text
source: Grbl Panel
fr_fr: Panneau GRBL

# btnStatusGetParser.Text
source: Refresh
fr_fr: Rafraichis

# gbFeedRate.Text
source: Feed Rate
fr_fr: Vitesse Avance

# cbUnits.Text
source: Metric
fr_fr: Métrique

# tbCurrentStatus.ToolTip
source: Shows status of Grbl
fr_fr: Montre le statut de Grbl

# cbVerbose.Text
source: Verbose
fr_fr: Verbeux

# gbStatus.Text
source: Status
fr_fr: Statut

# cbMonitorEnable.Text
source: Monitor
fr_fr: Moniteur

# Label23.Text
source: Elapsed
fr_fr: Passé

# Label51.Text
source: of
fr_fr: de

# stat.HeaderText
source: Sts
fr_fr: Stats

# lineNum.HeaderText
source: Line
fr_fr: Ligne

# btnFileReload.ToolTip
source: Reload File
fr_fr: Recharge Fichier

# btnFilePause.ToolTip
source: Pause sending
fr_fr: Pause l'envoi

# btnFileSelect.ToolTip
source: Load a file
fr_fr: Charge un fichier

# btnFileSend.ToolTip
source: Start/Resume sending
fr_fr: Démarre/Reprend l'envoi

# btnFileStop.ToolTip
source: Stop sending
fr_fr: Arrètes l'envoi

# btnConnect.Text
source: Connect
fr_fr: Connectes

# btnIPConnect.Text
source: Connect
fr_fr: Connectes

# tbIPAddress.ToolTip
source: Enter IP Address and port as "<IP>:<port>"
fr_fr: Entrez Adresse IP et Port "<IP>:<port>"

# tbWorkZ.ToolTip
source: Work Z position
fr_fr: Position Travail Z

# tbMachZ.ToolTip
source: Machine Z position
fr_fr: Position Machine Z

# tbWorkY.ToolTip
source: Work Y position
fr_fr: Position Travail Y

# tbMachY.ToolTip
source: Machine Y position
fr_fr: Position Machine Y

# tbMachX.ToolTip
source: Machine X position
fr_fr: Position Machine X

# tbWorkX.ToolTip
source: Work X position
fr_fr: Position Travail X

# GroupBox1.Text
source: Active Offset
fr_fr: Décalage Actif

# btnWorkSoftHome.Text
source: Go To Spcl Posn1
fr_fr: Va en Pos Spé 1

# btnWorkSoftHome.ToolTip
source: GoTo Position 1 using G28
fr_fr: Va en Position 1 avec G28

# btnHome.Text
source: Home Cycle
fr_fr: Cycle de Homing

# btnHome.ToolTip
source: Perform Homing Cycle
fr_fr: Effectue le Cycle de Homing

# btnWorkSpclPosition.Text
source: Go To Spcl Posn2
fr_fr: Va en Pos Spé 2

# btnWorkSpclPosition.ToolTip
source: Go To Position 2 using G30
fr_fr: Va en Position 2 avec G30

# btnWork0.ToolTip
source: Set all axes to 0 on Active Offset
fr_fr: Mets tous les axes à 0 sur le décalage Actif

# btnWorkX0.ToolTip
source: Set X axis to 0 on Active Offset
fr_fr: Mets l'axe X à 0 sur le décalage Actif

# btnWorkZ0.ToolTip
source: Set Z axis to 0 on Active Offset
fr_fr: Mets l'axe Z à 0 sur le décalage Actif

# btnWorkY0.ToolTip
source: Set Y axis to 0 on Active Offset
fr_fr: Mets l'axe Y à 0 sur le décalage Actif

# tpWork.Text
source: Work
fr_fr: Travail

# btnSetOffsetG59.ToolTip
source: Click to set to Current Machine Location
fr_fr: Cliquer pour régler sur Position Actuelle de la machine

# btnSetOffsetG58.ToolTip
source: Click to set to Current Machine Location
fr_fr: Cliquer pour régler sur Position Actuelle de la machine

# btnSetOffsetG57.ToolTip
source: Click to set to Current Machine Location
fr_fr: Cliquer pour régler sur Position Actuelle de la machine

# btnSetOffsetG56.ToolTip
source: Click to set to Current Machine Location
fr_fr: Cliquer pour régler sur Position Actuelle de la machine

# btnSetOffsetG55.ToolTip
source: Click to set to Current Machine Location
fr_fr: Cliquer pour régler sur Position Actuelle de la machine

# btnSetOffsetG54.ToolTip
source: Click to set to Current Machine Location
fr_fr: Cliquer pour régler sur Position Actuelle de la machine

# Label10.Text
source: Current Machine location
fr_fr: Position Actuelle de la machine

# tbOffSetsMachZ.ToolTip
source: Current Machine Z
fr_fr: Actuel Z Machine

# Label19.Text
source: Tool Length Offset
fr_fr: Décalage longueur d'outil

# tbOffSetsMachY.ToolTip
source: Current Machine Y
fr_fr: Actuel Y Machine

# tbOffSetsMachX.ToolTip
source: Current Machine X
fr_fr: Actuel X Machine

# btnOffsetsSave.Text
source: Save
fr_fr: Sauvegarder

# btnOffsetsSave.ToolTip
source: Save Work Offsets to File
fr_fr: Sauvegarder Décalages Travail dans Fichier

# btnOffsetsRetrieve.Text
source: Retrieve
fr_fr: Retrouver

# btnOffsetsRetrieve.ToolTip
source: Get from Grbl
fr_fr: Obtenir de Grbl

# btnOffsetsLoad.Text
source: Load
fr_fr: Charge

# btnOffsetsLoad.ToolTip
source: Load Work Offsets from File
fr_fr: Charger Décalages Travail depuis Fichier

# Label20.Text
source: Work Offsets
fr_fr: Décalages Travail

# tpOffsets.Text
source: Offsets
fr_fr: Décalages

# tpOffsets.ToolTipText
source: Click to set to Current Machine Location
fr_fr: Cliquer pour régler sur Position Actuelle de la machine

# Label4.Text
source: Last Grbl Param
fr_fr: Dernier Param. Grbl

# tbSettingsGrblLastParam.ToolTip
source: Change this to reflect the highest Grbl Parameter number
fr_fr: Modifier ceci pour refléter le plus grand nombre des paramètres Grbl

# btnSettingsGrbl.Text
source: Get Grbl Settings
fr_fr: Obtenir les réglages de Grbl

# gbGrblSettings.Text
source: Grbl Settings
fr_fr: Réglages Grbl

# btnOffsetsG28Set.Text
source: Set
fr_fr: Régler

# btnOffsetsG28Set.ToolTip
source: Set Special Position 1 to current Machine position
fr_fr: Régler Position Spéciale 1 sur Position Actuelle de la Machine

# btnSettingsRetrieveLocations.Text
source: Retrieve
fr_fr: Retrouver

# btnSettingsRetrieveLocations.ToolTip
source: Get current settings from Grbl
fr_fr: Obtenir les réglages actuels de Grbl

# Label7.Text
source: (Work Offsets are set from main page)
fr_fr: (Décalages Travail réglés depuis la page principale)

# Label18.Text
source: Machine Locations
fr_fr: Positions Machine

# btnOffsetsG30Set.Text
source: Set
fr_fr: Régler

# btnOffsetsG30Set.ToolTip
source: Set Special Position 2 to current Machine position
fr_fr: Régler Position Spéciale 2 sur Position Actuelle de la Machine

# gbSettingsOffsets.Text
source: Offsets (2)
fr_fr: Décalages (2)

# Label42.Text
source: These settings always save on exit of Grbl-Panel
fr_fr: Ces réglages sont toujours sauvegardés en quittant Grbl-Panel

# Label5.Text
source: Startup delay
fr_fr: Delais de démarrage

# Label6.Text
source: Default File ext
fr_fr: Extension Fic. Defaut

# cbSettingsLeftHanded.Text
source: Left Handed GUI
fr_fr: UI Gaucher

# cbSettingsConnectOnLoad.Text
source: Connect on Load
fr_fr: Connecte au chargt

# cbSettingsConnectOnLoad.ToolTip
source: Connect automatically to last port
fr_fr: Connecte automatiqumt au dernier Port

# cbSettingsPauseOnError.Text
source: Pause on Error
fr_fr: Pause sur erreur

# cbStatusPollEnable.Text
source: Status Poll
fr_fr: Collecte Statut

# btnSettingsRefreshMisc.Text
source: Refresh
fr_fr: Rafraichit

# Label37.Text
source: RBuf Max Size
fr_fr: Taille Max Buffer

# Label36.Text
source: Q Max Size
fr_fr: Taille Max Q

# Label26.Text
source: Poll Interval (ms)
fr_fr: Collecte Intervalle (ms)

# gbSettingsMisc.Text
source: Misc
fr_fr: Divers

# Label8.Text
source: GoTo Spcl Posn 2
fr_fr: Va en Spé Pos 2

# btnSettingsRefreshPosition.Text
source: Refresh
fr_fr: Rafraichit

# Label29.Text
source: Work Z 0 cmd
fr_fr: Cmd Travail Z 0

# Label28.Text
source: Work Y 0 cmd
fr_fr: Cmd Travail Y 0

# Label13.Text
source: Work X 0 cmd
fr_fr: Cmd Travail X 0

# Label12.Text
source: Zero All Cmd
fr_fr: Cmd Zero TOUS

# Label11.Text
source: Go To Spcl Posn1
fr_fr: Va en Spé Pos 1

# Label11.ToolTip
source: Also known as Soft Home
fr_fr: Connu aussi comme Origine Douce

# cbSettingsKeyboardJogging.Text
source: Enable keyboard arrows
fr_fr: Active les Flèches Clavier

# cbSettingsKeyboardJogging.ToolTip
source: Allow arrows, pg up, pg dn to do jogging
fr_fr: Permet les Fléches, Pg haute, Pg Basse pour le jogging

# btnSettingsRefreshJogging.Text
source: Refresh
fr_fr: Rafarichit

# Label41.Text
source: Button Repeat Rate, r/sec
fr_fr: Taux Répétition Bouton, T/sec

# Label40.Text
source: Z Repeat Rate
fr_fr: Taux Répétition Z

# Label39.Text
source: Y Repeat Rate
fr_fr: Taux Répétition Y

# Label38.Text
source: X Repeat Rate
fr_fr: Taux Répétition X

# Label35.Text
source: Metric
fr_fr: Métrique

# Label34.Text
source: Imperial
fr_fr: Impérial

# Label32.Text
source: Feed Rates
fr_fr: Taux d'Avance

# Label33.Text
source: Feed Increments
fr_fr: Incréments Avance

# Label31.Text
source: Feed Rates
fr_fr: Taux d'Avance

# Label30.Text
source: Feed Increments
fr_fr: Incréments Avance

# cbSettingsMetric.Text
source: Metric
fr_fr: Métrique

# gbSettingsJogging.Text
source: Jogging
fr_fr: Joging

# tabPgSettings.Text
source: Settings
fr_fr: Réglages

# btnAdd.Text
source: Add
fr_fr: Ajouter

# lblName.Text
source: Name:
fr_fr: Nom

# gbEditor.Text
source: Editor
fr_fr: Editeur

# btnCancel.Text
source: Cancel
fr_fr: Abandonner

# Column1.HeaderText
source: Name
fr_fr: Nom

# btnDeleteMacro.Text
source: Delete Selected
fr_fr: Effacer la Sélection

# ofdGcodeFile.Filter
source: All files (*.*)|*.*
fr_fr: Tous Fichiers (*.*)|*.*

# sfdOffsets.Filter
source: WorkOffset Files|*.xml
fr_fr: Fichiers Décalage Travail|*.xml

# ofdOffsets.Filter
source: WorkOffset Files|*.xml
fr_fr: Fichiers Décalage Travail|*.xml
